## Data Filtreleme

In [3]:
import numpy as np
import pandas as pd

In [4]:
people = {
    "first": ["Corey", 'Jane', 'John'],
    "last": ["Schafer", 'Doe', 'Doe'],
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [5]:
df = pd.DataFrame(people)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [6]:
df['last'] == 'Doe'

0    False
1     True
2     True
Name: last, dtype: bool

In [7]:
filt = (df['last'] == 'Doe')
filt

0    False
1     True
2     True
Name: last, dtype: bool

In [8]:
df[filt]  # filtrede True ile eslesenleri verir

  first last              email
1  Jane  Doe  JaneDoe@email.com
2  John  Doe  JohnDoe@email.com

In [9]:
df.loc[filt]   # loc methodu ile de kullanilabilir

  first last              email
1  Jane  Doe  JaneDoe@email.com
2  John  Doe  JohnDoe@email.com

In [10]:
df.loc[filt,'email']

1    JaneDoe@email.com
2    JohnDoe@email.com
Name: email, dtype: object

In [11]:
# Soru -1 :
# ilk ismi(first) 'John' ve soyadı(last) 'Doe' olan kişilerin email bilgisini
# getiren filtreyi yazıp data frame'e uygulayalım ve email bilgisini alalım.

filt1 = (df['first'] == 'John') & (df['last'] == 'Doe')
df.loc[filt1,'email']

2    JohnDoe@email.com
Name: email, dtype: object

In [12]:
# Soru -2 :
# ilk ismi(first) 'John' veya soyadı(last) 'Schafer' olan kişilerin email bilgisini
# getiren filtreyi yazıp data frame'e uygulayalım ve email bilgisini alalım.

filt2 = (df['first'] == 'John') | (df['last'] == 'Schafer')
df.loc[filt2,'email']

0    CoreyMSchafer@gmail.com
2          JohnDoe@email.com
Name: email, dtype: object

In [13]:
# Soru -3 :
# 2.soruda yazdığınız filtrenin tersini yapan filtreyi bulup
# data frame'e uygulayalım.

filt2 = ((df['first'] == 'John') | (df['last'] == 'Schafer'))
df.loc[-filt2,'email']

1    JaneDoe@email.com
Name: email, dtype: object

In [14]:
filt2 = ~((df['first'] == 'John') | (df['last'] == 'Schafer'))
df.loc[filt2,'email']

1    JaneDoe@email.com
Name: email, dtype: object

In [15]:
yazar_series = pd.Series(['Dostoyevski', 'Tolstoy', 'Hugo', 'Tarkovski'])
kitapno_series = pd.Series([210, 211, 114, 178])

my_dict = { 'Yazar': yazar_series, 'KitapNo': kitapno_series }
df_m = pd.DataFrame(my_dict)
df_m

         Yazar  KitapNo
0  Dostoyevski      210
1      Tolstoy      211
2         Hugo      114
3    Tarkovski      178

In [16]:
yas = [21,22,23,24]
df_m['Age'] = pd.Series(yas)
df_m

         Yazar  KitapNo  Age
0  Dostoyevski      210   21
1      Tolstoy      211   22
2         Hugo      114   23
3    Tarkovski      178   24

In [17]:
df_m['Ulke'] = pd.DataFrame(['RU','RU','FR','RU'])
df_m

         Yazar  KitapNo  Age Ulke
0  Dostoyevski      210   21   RU
1      Tolstoy      211   22   RU
2         Hugo      114   23   FR
3    Tarkovski      178   24   RU

In [18]:
df_m[5] = pd.DataFrame([1,2,3,4])
df_m

         Yazar  KitapNo  Age Ulke  5
0  Dostoyevski      210   21   RU  1
1      Tolstoy      211   22   RU  2
2         Hugo      114   23   FR  3
3    Tarkovski      178   24   RU  4

In [19]:
df_m['Sehir'] = ['Petersburg','Moskova','Paris','Istanbul']
df_m

         Yazar  KitapNo  Age Ulke  5       Sehir
0  Dostoyevski      210   21   RU  1  Petersburg
1      Tolstoy      211   22   RU  2     Moskova
2         Hugo      114   23   FR  3       Paris
3    Tarkovski      178   24   RU  4    Istanbul

In [20]:
df_m.columns.values[4] = 'Sıra'

df_m

         Yazar  KitapNo  Age Ulke  Sıra       Sehir
0  Dostoyevski      210   21   RU     1  Petersburg
1      Tolstoy      211   22   RU     2     Moskova
2         Hugo      114   23   FR     3       Paris
3    Tarkovski      178   24   RU     4    Istanbul

In [21]:
df_m['Yazar'] == 'Hugo'

0    False
1    False
2     True
3    False
Name: Yazar, dtype: bool

In [22]:
df_m[df_m['Yazar'] == 'Hugo'].index

Int64Index([2], dtype='int64')

In [23]:
my_filt = df_m['Yazar'] == 'Hugo'

In [24]:
df_m.drop(index = df_m[my_filt].index)   # kalici olarak silmez

         Yazar  KitapNo  Age Ulke  Sıra       Sehir
0  Dostoyevski      210   21   RU     1  Petersburg
1      Tolstoy      211   22   RU     2     Moskova
3    Tarkovski      178   24   RU     4    Istanbul

In [25]:
df_m

         Yazar  KitapNo  Age Ulke  Sıra       Sehir
0  Dostoyevski      210   21   RU     1  Petersburg
1      Tolstoy      211   22   RU     2     Moskova
2         Hugo      114   23   FR     3       Paris
3    Tarkovski      178   24   RU     4    Istanbul

In [26]:
# DataFrame'deki Mevcut Data uzerinde Guncelleme yapma

In [27]:
df = pd.DataFrame(people)

In [28]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [29]:
df.columns.values[0] = 'first_name'

In [30]:
df

  first_name     last                    email
0      Corey  Schafer  CoreyMSchafer@gmail.com
1       Jane      Doe        JaneDoe@email.com
2       John      Doe        JohnDoe@email.com

In [31]:
df.columns.values[[0,1]] = ['first_n','last_n']

In [32]:
df

  first_n   last_n                    email
0   Corey  Schafer  CoreyMSchafer@gmail.com
1    Jane      Doe        JaneDoe@email.com
2    John      Doe        JohnDoe@email.com

In [33]:
df = pd.DataFrame(people)

In [34]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [35]:
df.rename(columns={'first':'first_name'}, inplace=True)

In [36]:
df.rename(columns={'email':'e-mail', 'last':'last_name' }, inplace = True)

In [37]:
df

  first_name last_name                   e-mail
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [38]:
df.columns = df.columns.str.replace('_',' ')
df

  first name last name                   e-mail
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [39]:
df.rename(columns={'e-mail':'email', 'first name':'first', 'last name':'last' }, inplace = True)

In [40]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [41]:
df.loc[2]

first                 John
last                   Doe
email    JohnDoe@email.com
Name: 2, dtype: object

In [42]:
df.loc[2] = ['John','Smith','JohnSmith@email.com']

In [43]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith      JohnSmith@email.com

In [44]:
df.loc[2,['last','email']] = ['Doe','JohnDoe@email.com']

In [45]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [46]:
filt = ( df['email'] == 'JohnDoe@email.com' )

df.loc[filt, 'last'] = 'Smith'

In [47]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [48]:
df.loc[2, 'last']= 'Doe'

In [49]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

### Sorting

In [50]:
df.sort_values(by = 'last')

   first     last                    email
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
0  Corey  Schafer  CoreyMSchafer@gmail.com

In [51]:
# ascending = False ters siralar
df.sort_values(by = 'last', ascending = False)

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [52]:
df.sort_values(by = ['last','first'], ascending = False)
# once last' gore siralar ayni varsa first'e gore siralar

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
2   John      Doe        JohnDoe@email.com
1   Jane      Doe        JaneDoe@email.com

In [53]:
df.sort_values(by = ['first','last'], ascending = False)

   first     last                    email
2   John      Doe        JohnDoe@email.com
1   Jane      Doe        JaneDoe@email.com
0  Corey  Schafer  CoreyMSchafer@gmail.com

In [54]:
df.loc[3] = ['Adam', 'Doe', 'A@email.com']

In [55]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe              A@email.com

In [56]:
df.sort_values(by = 'last', ascending = False)

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe              A@email.com

In [57]:
df.sort_values(by = ['last','first'], ascending = False)

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
2   John      Doe        JohnDoe@email.com
1   Jane      Doe        JaneDoe@email.com
3   Adam      Doe              A@email.com

In [58]:
df.sort_values(by = ['first','last'], ascending = [True ,False])

   first     last                    email
3   Adam      Doe              A@email.com
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [59]:
df.sort_values(by = ['last','first'], ascending = [False,True])

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
3   Adam      Doe              A@email.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [60]:
df.sort_index()

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe              A@email.com

In [61]:
df['last'].sort_values()

1        Doe
2        Doe
3        Doe
0    Schafer
Name: last, dtype: object